#+TITLE: Arrays
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: CSC 240 - Data structures with C++ - Lyon College, FA24
#+STARTUP:overview hideblocks indent
#+OPTIONS: toc:1 num:1 ^:nil
#+PROPERTY: header-args:C++ :main yes :includes <iostream> :results output :exports both :noweb yes
#+PROPERTY: header-args:C :main yes :includes <stdio.h> :results output :exports both :noweb yes
* Overview

We review C by continuing with derived data types that you should
already know: arrays, pointers, functions. We review by coding and
analyzing code.

In this section, we focus on one-dimensional array data
structures. Multi-dimensional arrays are less important in C because
/arrays of pointers/ are a more flexible way to store multi-dimensional
data.

*Objectives:*
- Tackling problems, solutions, and coding rules
- Different ways of developing and running code
- One-dimensional arrays, =for= loops, =scanf= and =printf=
- Use of macros and =sizeof= to set/read array lengths
- Variable-sized arrays (new!) and new basic data types
- Application: Reversing series of numbers
- Application: Checking numbers for repeated digits
- Code along and solve different exercises
- Review questions, glossary, and summary

*Code along:*
1. Open Emacs from the command line with =emacs &= (or from desktop)
2. Create an Org-mode file with =C-x C-f 2_arrays.org=
3. Create a C code chunk with =<s <TAB> C=
4. Add header arguments: ~:main yes :includes <stdio.h> :results output~
   if you don't have a =PROPERTY= line at the top
5. Write and run a "hello world" test program: =puts("hello world");=
6. Keep running chunks with =C-c C=c= to check for syntax errors.
7. If any of these steps don't work for you, let me know!

For example: a simple "hello world" program in an Emacs Org-mode code
block:
#+begin_src C
  printf("Hello, world!");
#+end_src

#+RESULTS:
: Hello, world!

[[https://youtu.be/Oq83ZCu8FUI?si=qQGQPFrjq2RvhWln][See my YouTube channel]] (=@Literate Programming with Emacs and Org-mode=)
for a short literate programming tutorial: [[https://tinyurl.com/first-lit-prog][tinyurl.com/first-lit-prog]].

See also "Everything You Thought You Knew About Arrays is Wrong (in C
Programming). This is Why." by Code with Huw ([[https://youtu.be/bFAO99USrYI?si=as3gDNZKaXstLwWu][YouTube, 10 August 2024]])

* Solution

- *Strategy:* The numbers are stored in an array of N = 10 elements. N
  is defined at the start with =#define=. The array is initialized with
  zeros. The numbers are retrieved from standard input with =scanf=
  counting up with a =for= loop, and printed in reverse order with
  =printf= counting down with a =for= loop.

- *Program* =reverse.c=:
  #+begin_src C :tangle reverse.c :main no :includes :cmdline < input
    /**************************************************************/
    // reverse.c: reverse a series of numbers entered by the user
    // Store numbers as int array with scanf in a for loop
    // Print numbers in reverse order with printf in a for loop
    /**************************************************************/
    #include <stdio.h> // include input/output header file
    #define N 10  // define constant array length with directive

    int main() // main program
    {
      int i;           // declare loop variable
      int a[N] = {0};  // macro definition (uses constant N)
      printf("Enter 10 numbers: "); // ask for input
      for ( i = 0; i < N; i++) { // loop over array (counting up)
        scanf("%d", &a[i]); // get the i-th array element from stdin
        printf("%d ", a[i]); // print the i-th array element to stdout
      }
      puts("");  // add new line
      printf("In reverse order: ");
      for ( i = N-1; i >= 0; i--) { // loop over array (counting down)
        printf("%d ", a[i]);
      }
      puts("");
      return 0; // confirm program ran successfully
    } // end of main program
  #+end_src

  #+RESULTS:
  : Enter 10 numbers: 34 82 49 102 2 94 23 11 50 31
  : In reverse order: 31 50 11 23 94 2 102 49 82 34

- To compile and run this program, you have three options[fn:3]:
  1. Add the header argument =:cmdline < input= where =input= is a text
     file containing the test input data. Then run the code block with
     =C-c C-c=. You can create an input file in a shell code block.
  2. Tangle the source code for compilation, debugging and execution
     on the command-line, add the header argument =:tangle reverse.c=,
     tangle with =C-u C-c C-v t= and run it on the command-line shell
     with the chain command: =gcc reverse.c -o rev && ./rev=.
  3. You can also tangle the file as ~reverse.c~ (=C-u C-c C-v t=) and run
     it in a shell code block with the test input:
     #+begin_src bash :results output :exports both
       gcc reverse.c -o rev
       echo 34 82 49 102 2 94 23 11 50 31 | ./rev
     #+end_src

     #+RESULTS:
     : Enter 10 numbers: 34 82 49 102 2 94 23 11 50 31
     : In reverse order: 31 50 11 23 94 2 102 49 82 34

     Let's see how this works:
     1) =gcc reverse.c -o rev= compiles the file and creates an output
        file called =rev=
     2) =echo= prints its arguments (the test series) to stdout
     3) The pipe symbol =|= takes the output on its left and serves it
        as stdin on the right.
     4) =./rev= receives the input from the left and runs with it.
     5) The =./= is necessary for the shell to find the executable file
        =rev= in the current directory.

* NEXT Notes

1. Is the program proofed against wrong input? Try to break it using
   the command-line executable entering characters or words instead,
   or leave out numbers.

2. You can use /variable-length arrays/ if you don't want to fix the
   length of the array - but you cannot initialize it (since the
   length of the array is not known at compile-time):
   #+begin_src C :tangle reverse2.c :main yes :includes <stdio.h> :results none :exports both
     int i, n;
     printf("How many numbers do you want to reverse: ");
     scanf("%d", &n);
     int a[n];
     printf("Enter %d numbers: ", n);
     for ( i = 0; i < n; i++) {
       scanf("%d", &a[i]);
      }; puts("");
     printf("In reverse order: ");
     for ( i = n-1; i >= 0; i--) {
       printf("%d ", a[i]);
      }; puts("");
   #+end_src

   Tangle the source file =reverse2.c=, and on the command-line, run:
   #+begin_src bash :results output :exports both
     gcc reverse2.c -o rev2
     echo 4 5 4 3 2 | ./rev2  # output: 2 3 4 5
   #+end_src

3. We can compute the length of an array =a= using the =sizeof=
   operator, which is useful if we don't know the length[fn:4].
   #+begin_src C :main no
     #define N 10
     #define SIZE (int)(sizeof(a)/sizeof(a[0]))

     int main (void)
     {
       int i;
       int a[N];
       printf("SIZE = %d\n", SIZE);
       for (i = 0; i < SIZE; i++) {
         a[i] = i+1;
         printf("%d ", a[i]);
       }
       return 0;
     }
   #+end_src

   #+RESULTS:
   : SIZE = 10
   : 1 2 3 4 5 6 7 8 9 10

4. Macros can also have parameters. Here are two examples:
   #+begin_src C
     #define MAX(x,y) ((x)>(y) ? (x):(y))
     #define IS_EVEN(n) ((n)%2==0)

     printf("Max value: %d\n", MAX(100,200)); // use parametrized macro
     printf("Is 100 even? %d\n", IS_EVEN(100)); // use parametrized macro
   #+end_src

   #+RESULTS:
   : Max value: 200
   : Is 100 even? 1

   In the definition of =MAX=, =x > y ? x : y= is a short version of
   =if...else=:
   #+begin_example C
   if (x > y)
      x
   else
      y
   #+end_example

   You can also use macros to create aliases for commands you're
   tired of typing, like =printf("%d\n",i);=
   #+begin_src C
     #define PRINT_INT(n) printf("%d\n",n);

     int i = 200, j = 100;
     PRINT_INT(i/j);
   #+end_src

   #+RESULTS:
   : 2

* Solution

- *Strategy*: The program uses an array of Boolean values =digits_seen= to
  keep track of which digits 0-9 xappear in a number. Initially, every
  element of the array is =false=. When given a number =n=, the program
  examines its digits one at a time, storing each into the =digit=
  variable, and then using it as an index into =digit_seen=. if
  =digit_seen[digit]= is =true=, then =digit= appears at least twice in
  =n=. If =digit_seen[digit]= is =false=, then =digit= has not been seen
  before, so the program sets =digit_seen[digit= to =true= and keeps
  going.

- *Program* =repdigit.c=:
  #+begin_src C :tangle repdigit.c :main no :includes :results none :exports both
    /*********************************************************/
    // repdigit.c: checks numbers for repeated digits.
    // Input: number with (without) repeated digits.
    // Output: Print "Repeated digit" or "No repeated digit."
    /*********************************************************/
    #include <stdbool.h> // defines `bool` type
    #include <stdio.h>

    int main(void)
    {
      // variable declarations and initialization
      bool digit_seen[10] = {false}; // initialized to zeros = false
      int digit;
      unsigned long int n; // an unsigned long integer type

      // getting user input
      printf("Enter a number: ");
      scanf("%lu", &n);
      printf("%ld\n", n);

      // scan input number digit by digit
      while (n > 0) { // loop while n positive
        digit = n % 10; // example output: 28212 % 10 = 2
        if (digit_seen[digit]) // if true then digit repeats
          break; // leave loop
        digit_seen[digit] = true;
        n /= 10; // example output: (int) (28212/10) = (int) 2821.2 = 2821
      } // finishes when (int) single digit / 10 = 0

      // print result
      if (n > 0) // found repeat digit before scanning whole number
        printf("Repeated digit\n");
      else  // n = 0 means scanning finished = all digits seen
        printf("No repeated digit\n");

      return 0;
    }
  #+end_src

- Testing:
  #+begin_src bash :results output :exports both
    gcc repdigit.c -o rep
    echo 1987654321 | ./rep
  #+end_src

  #+RESULTS:
  : Enter a number: 1987654321
  : Repeated digit

* Notes

1. Make sure you understand the algorithm:
   1) =digit_seen= is a Boolean vector of 10 values initialized to be
      =false= when none of the digits of =n= have been visited yet.
   2) The first =digit= is =n % 10=, that is the remainder of dividing =n=
      by 10. For example for 28212 = 2821 * 10 + 2, 28212 % 10 = 2.
   3) The array element corresponding to =digit = 2= is
      =digit_seen[digit] = digit_seen[2]=. It is 0 (=false=) if the
      digit has not been seen yet, and it is 1 (=true=) if it has been
      seen.
   4) In the latter case (1), the =break= command leads out of the
      =while= loop, because the answer "Are there any repeated digits"
      has been answered.
   5) In the former case (0), =digit_seen[true]= is now set to 1
      (because the digit has been seen), and we move on to the next
      digit: =n / 10= removes the last digit, e.g. =28212 / 10 = 2821.2=
      but =int(2821.2) = 2821=, and the loop starts over for the next
      digit.
   6) If the loop was left early because a repeated digit was found,
      =n > 0=, and ="Repeated digit"= is printed.
   7) If the loop ran through all digits, no repeated digits were
      found, and =n=0= because the last digit divided by 10 is smaller
      than 10, hence its integer part is 0, and =No repeated digit= is
      printed.

2. You don't need to load =<stdbool.h>=, you can also =#define= Boolean
   values and use C's =typedef= keyword to create a synonym for
   previously defined types:
   #+begin_src C :results none
     #define true 1
     #define false 0
     typedef int bool;
   #+end_src
3. C has a number of different =int= types. On a 64-bit machine,
   =unsigned long int= can hold positive whole numbers up to
   $18,446,744,073,709,551,615$. Do you know why that is?
   #+begin_quote
   The largest value is 2^64-1: 64 bits (or 8 words/bytes of 8 bit
   length) can be used to represent a value in binary number 0,1.

   For example, with 3 bits you can represent 2^3=8 values ranging
   from (000) to (111). Likewise, for an n-bit unsigned integer, the
   values range from 0 to 2^n-1. For n=64 that's the number given.

   Can you guess what the range of values will be for =long int=
   (which allows positive and negative integers)?[fn:5]
   #+end_quote
   #+begin_src C :main no
     #include <stdio.h>
     #include <limits.h> // contains definition of ULONG_MAX

     int main() {
       unsigned long int max_value = ULONG_MAX; // max value for unsigned
       // long int
       printf("The largest value for unsigned long int is: %lu\n", max_value);
       return 0;
     }
   #+end_src

   #+RESULTS:
   : The largest value for unsigned long int is: 18446744073709551615
4. To capture =unsigned long int= numbers, =scanf= requires the =%lu=
   format specification.

* Debugging with =gdb=

- Check that you have the GNU debugger with =gdb --version=. If this
  does not work, you have to install =gdb= with =sudo apt install gdb=.

  #+begin_src bash :results output :exports both
  gdb --version
  #+end_src

  #+RESULTS:
  : GNU gdb (Ubuntu 12.1-0ubuntu1~22.04.2) 12.1
  : Copyright (C) 2022 Free Software Foundation, Inc.
  : License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
  : This is free software: you are free to change and redistribute it.
  : There is NO WARRANTY, to the extent permitted by law.

- To debug files, you must compile the source code file with the
  additional flag =-g=:
  #+begin_src bash :results none
    gcc repdigit.c -o rep -g
  #+end_src

- For the debugging session, you need to open a shell in Emacs with
  =M-x shell= and run =gdb ./rep=.

- Once you're in the debugger, you can set break points with =break=
  (for example, =break main= will break at the start of =main=, or =break
  19= will break at line 19 of the source code file), execute the file
  with =run=, go from statement to statement with =next=, get variables
  with =print= (e.g. =print n=), or all local variables with =info locals=.

- Let's do it together to understand the =repdigit.c= program better!

- The debugger is the more useful the more moving parts your program
  has, and we'll use it often when we start building larger programs
  with functions and data structures.

- For more information, see the =gdb(1)= man page (=M-x man gdb RET= in
  Emacs, or [[https://www.man7.org/linux/man-pages/man1/gdb.1.html][online]]).
  
